---
kind: other
id: Properties.T:Autodesk.Revit.DB.DefinitionGroup
source: html/b39e57c3-54e0-1f58-5ff7-b58a93fd79d2.htm
---
# DefinitionGroup Properties

The Definitions property returns an object that contains all the shared parameter
definitions within the group.